Documents/proposal.tex
% Created 2019-10-17 Thu 14:58
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Alice Ip, Kexin Liu, Lily Lau, Meijing Li}
\date{October 16, 2019}
\title{CS/SE 3GC3 - Computer Graphics Final Project}
\hypersetup{
 pdfauthor={Alice Ip, Kexin Liu, Lily Lau, Meijing Li},
 pdftitle={CS/SE 3GC3 - Computer Graphics Final Project},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Project Proposal}
\label{sec:org0684215}

\subsection*{Description}
\label{sec:org12e0e36}
A cooking game that takes place in a 3-D simulating kitchen, where the player is able 
to move aroud in first person to select and deselect ingredients and use tool 
objects to interact with these ingredient objects. There are several recipes 
that the player can follow. The player combines tools and food objects to get
 intermediate objects that can then be combined with other objects to create a dish.
 Food objects and tool objects are scattered throughout the room. Food objects may
 include apples, salt, eggs, and tool objects may include knives, pans, and ovens.


\subsection*{Code Objectives}
\label{sec:orga6abff0}
Some objectives and goals that need to be fulfilled in the production of this 
game includes constructing the 3-D models for ingredient objects, tool objects
furniture in the kitchen, as well as the kitchen room itself. Appropriate event
handlers will be needed include mouse clicking to select objects and keyboard keys
to move around inside the kitchen room. Additional features include animation 
of when food objects split into smaller pieces when cut using a knife object, as 
well as gravity features for objects when they are dropped, momentum of objects
when interacted with, appropriate textures for the furniture, the room, and food
and changes in colour/texture when food is cooked or prepared.
\end{document}
